{
    "projects": [
        {

            "id": "0",
            "project_name": "MovieVerse",
            "heading": "Vaccine Tracker - MERN stack app",
            "tagline": "Manage clinical vaccine trials, track patients, record vitals",
            "thumbnail": "https://i.imgur.com/k1xUebr.png",
            "startDate": "May 2023",
            "languages": ["javascript", "HTML", "CSS"],
            "tools": ["Mongo DB", "Express", "React", "Node", "MongoDB atlas"],
            "libraries": [
              "axios",
              "bootstrap",
              "dotenv",
              "react-chartjs-2",
              "cors",
              "mongoose"
            ],
            "links": [
              {
                "icon": "github",
                "linkname": "github",
                "website_link": "https://github.com/MeenakshiKathiresan/vaccine-tracking",
                "color": "#292929"
              }
            ],
            "main_image": "https://user-images.githubusercontent.com/26730019/247542481-83c12d5b-761d-4f5b-819b-66fe93d8345f.png",
            "features": [
              "<strong>Clinical Trials:</strong> Users can create new clinical trials by defining a vaccine and specifying its three phases.",
              "<strong>Patient Management:</strong> Patients can be added to each phase of the clinical trials, tracking their progress through the different stages.",
              "<strong>Patient Observations:</strong> Users can record observations of patients' vitals, providing valuable data for analysis.",
              "<strong>Dashboard:</strong> The system generates a comprehensive dashboard on the home page, presenting real-time data visualizations and analytics for monitoring the overall progress and outcomes of the clinical trials."
            ],
            "project_impact": "MERN stack (MongoDB, Express.js, React.js, Node.js). By developing a dashboard and implementing CRUD (Create, Read, Update, Delete) operations, I have gained hands-on experience in building user-friendly interfaces and efficiently managing patient data. This project has allowed me to enhance my skills and proficiency in full-stack web development. I learnt to create basic analytics based on the data available and present it as a dashboard. The impact of this project extends beyond personal growth. It has the potential to streamline the vaccination process, improve patient management, and contribute to better public health outcomes. By providing a comprehensive tracking system, it can assist in monitoring the progress and outcomes of clinical trials, ultimately making a positive difference in people's lives."
          }
    ]

}