{
    "works": [
        {
            "_id": 0,
            "company_name": "RJ Systems Inc",
            "role_name": "Software Engineer",
            "start_date": "September 2024",
            "end_date": "Present",
            "achievements": [
                "Engineered end-to-end RESTful APIs for employee management systems, enabling seamless CRUD operations and robust access control; reduced data retrieval time by 50% while ensuring compliance with security protocols.",
                "Designed backend logic for automated invoicing systems, integrating time-tracking data and fixed-rate calculations, streamlining invoice generation and ensuring accurate financial records.",
                "Implemented automated asynchronous background jobs for email and SMS notifications using third-party integrations, improving communication efficiency and system scalability.",
                "Integrated automated unit tests, improving test coverage by 20% and ensuring software reliability."
            ],
            "languages": [
                "Python"
            ],
            "tools": [
              
            ],
            "libraries": [
                "Django",
                "Batch Processing",
                "SQL Databases",
                "Agile"
            ],
            "links": [
                {
                    "icon": "university",
                    "linkname": "company website",
                    "website_link": "https://rjsystemsinc.com/",
                    "color": "#868686"
                }
            ],
            "company_logo": "assets/rjsystems.png" 

        },

        {
            "_id": 1,
            "company_name": "Outcome Logix",
            "role_name": "Software Engineer Intern",
            "start_date": "June 2022",
            "end_date": "Aug 2022",
            "achievements": [
                "Spearheaded the revitalization of the company portal using Java Media Frameworks, achieving KPI-driven increases in automation, productivity, and system flexibility; enhanced video data ingestion and streaming capabilities.",
                "Pioneered the implementation of advanced machine learning and deep learning techniques, specifically leveraging Convolutional Neural Networks (CNN) and TensorFlow Library, to transform the landscape of video data classification, including plagiarism detection.",
                "Surmounted challenging manual tasks through automated video data analysis and dataset preprocessing, employing Java and machine learning algorithms to significantly enhance data quality and analytical capabilities.",
                "Engaged in the collaborative design and Agile development of a comprehensive software testing framework, elevating the existing system’s performance by 25%; contributed to QA (Quality Assurance) and software reliability.",
                "Achieved exceptional and quantifiable outcomes in video analytics by deploying cutting-edge machine learning models, optimizing video frame analysis for improved operational efficiencies."
            ],
            "languages": [
                "Python"
            ],
            "tools": [
              
            ],
            "libraries": [
                "Machine Learning Algorithms",
                "Convolutional Neural Networks",
                "Tensorflow",
                "OpenCv",
                "Agile"
            ],
            "links": [
                {
                    "icon": "university",
                    "linkname": "company website",
                    "website_link": "https://outcomelogix.com/",
                    "color": "#868686"
                }
            ],
            "company_logo": "assets/outcome_logix_logo.png" 

        },

        {
            "_id": 2,
            "company_name": "Infosys Ltd",
            "role_name": "Software Engineer(BackEnd)",
            "start_date": "Feb 2017",
            "end_date": "Jan 2022",
            "achievements": [
                "Developed and maintained scalable RESTful APIs using Python & Django integrating with high-traffic enterprise systems.",
                "Optimized API performance and system-level architecture by applying data structures & algorithms, reducing response times by 20% and improving system scalability through code refactoring, PostgreSQL query optimization, and caching strategies.",
                "Implemented robust data validation and error handling, decreasing incorrect claims submissions by 25%, improving accuracy.",
                "Designed and extended API endpoints to meet evolving business needs, accelerating feature releases by 20%.",
                "Collaborated with business stakeholders and cross-functional teams, including business analysts, frontend developers, and project managers, to align architecture and API designs with business objectives and user needs, ensuring alignment on project goals.",
                "Enhanced API security and compliance by implementing OAuth2, JWT, role-based access control (RBAC), and secure data encryption protocols for regulatory compliance in financial systems.",
                "Led version control and CI/CD pipelines with GitLab, Jenkins,, ensuring seamless deployment, infrastructure automation, and cloud-based architectures across AWS and GCP environments.",
                "Developed and documented system architecture designs and strategies for cloud-based platforms, ensuring scalability, security, and high availability for enterprise applications.",
                "Monitored API performance using telemetry tools like Postman, New Relic, and Swagger, identifying and resolving bottlenecks.",
                "Contributed to debugging and logging frameworks, improving monitoring capabilities and system observability."
            ],
            "languages": [
                "Python","SQL","Javscript,RESTAPI's","System Design"
            ],
            "tools": [
              
            ],
            "libraries": [
                "Django Framework",
                "MYSQL",
                "CI/CD",
                "Authentication and Authorization",
                "GitLab",
                "Agile",
                "Postman"
            ],
            "links": [
                {
                    "icon": "university",
                    "linkname": "company website",
                    "website_link": "https://www.infosys.com/",
                    "color": "#868686"
                }
            ],
            "company_logo": "assets/logo-infosys.png" 

        }

    ]
}
    